src/cf/Enums/СтатусОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Частичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусОтгрузки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Сравнить(Значение1, Значение2) Экспорт
	
	ВесЗначений = Новый Соответствие;
	ВесЗначений.Вставить(Перечисления.СтатусОтгрузки.Отсутствует, 0);
	ВесЗначений.Вставить(Перечисления.СтатусОтгрузки.Частичная,   1);
	ВесЗначений.Вставить(Перечисления.СтатусОтгрузки.Полная,      2);
	
	Если ВесЗначений.Получить(Значение1) = Неопределено ИЛИ ВесЗначений.Получить(Значение2) = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru='Не определена операция сравнения для переданных значений: ""%1"", ""%2""'"), Значение1, Значение2);
	КонецЕсли;
	
	Возврат ВесЗначений.Получить(Значение1) - ВесЗначений.Получить(Значение2);
	
КонецФункции

#КонецОбласти


#КонецЕсли
